       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG23.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  NUMERO     PIC 99 VALUE 15.
       01  MENSAGEM   PIC X(20) VALUE "CURSO DE COBOL".
       01  NUMEROZERO PIC 9(5)  VALUE ZERO.
       01  ESPACOS    PIC X(30) VALUE SPACES.

       PROCEDURE DIVISION.

       MAIN-PROCEDURE.
           DISPLAY "Hello world".
           DISPLAY "NUMERO: " NUMERO " ACABOU".
           DISPLAY "MENSAGEM: " MENSAGEM " ACABOU".
           DISPLAY "ZEROS: " NUMEROZERO " ACABOU".
           DISPLAY "ESPACOS: " ESPACOS " ACABOU".

           DISPLAY "ATRIBUICAO".
           ADD 10 TO NUMEROZERO.
           DISPLAY "ZEROS: " NUMEROZERO " ACABOU".

           STOP RUN.

       END PROGRAM PROG23.
