       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG27.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01  VALOR1    PIC 999 VALUE 20.
       01  VALOR2    PIC 99  VALUE 5.
       01  RESULTADO PIC 999.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM EXIBE-VALORES.

           DISPLAY " ADD " VALOR2 " TO " VALOR1.
           ADD VALOR2 TO VALOR1.
           PERFORM EXIBE-VALORES.

           DISPLAY " SUBTRACT " VALOR2 " FROM " VALOR1.
           SUBTRACT VALOR2 FROM VALOR1.
           PERFORM EXIBE-VALORES.

           DISPLAY " MULTIPLY " VALOR2 " BY " VALOR1.
           MULTIPLY VALOR2 BY VALOR1.
           PERFORM EXIBE-VALORES.

           DISPLAY " DIVIDE " VALOR2 " INTO " VALOR1.
           DIVIDE VALOR2 INTO VALOR1.
           PERFORM EXIBE-VALORES.

           STOP RUN.

       EXIBE-VALORES.
           DISPLAY "VALOR1: " VALOR1 " VALOR2: " VALOR2.
           DISPLAY "=====".

       END PROGRAM PROG27.
